import java.util.Locale;
//Остановит ли когда-нибудь свою работу цикл вида:
//        Ваш ответ
//        Ошибка компиляции
//
//        Укажите способ создания именованного экземпляра класса:
//
//        Ваш ответ
//        Object();
//
//        У вас в проекте несколько классов. Можно ли в каждом из них объявить свой public static void main(String[] args)?
//
//        Ваш ответ
//        Нет
//
//        Если в коде какой-либо ветки if есть другое условие if, то такой условный оператор:
//
//        Ваш ответ
//        Комбинированный
//
//        Что появится в консоли в результате работы программы:
//
//        Ваш ответ
//        Java
//
//        Размер переменной типа char равен:
//
//        Ваш ответ
//        8 бит
//
//        С каким расширением хранится исходный код классов, а с каким скомпилированный?
//
//        Ваш ответ
//        Исходный код в .java, скомпилированный в .javac
//
//        По типу результата все методы можно разделить на:
//
//        Ваш ответ
//        Статические и не статические
//
//        Экземпляр класса String напрямую нельзя создать из:
//
//        Ваш ответ
//        Экземпляра класса StringBuffer
//
//        Можно ли использовать оператор return в void методе:
//
//        Ваш ответ
//        Нет
//
//        Какой из перечисленных методов объявлен некорректно:
//
//        Ваш ответ
//        String makeText(char... arr)
public class Test {
     public static void main(String[] args) {
     }

}