import java.util.Locale;
//Остановит ли когда-нибудь свою работу цикл вида:
//        Ваш ответ
//        Ошибка компиляции
//
//        Укажите способ создания именованного экземпляра класса:
//
//        Ваш ответ
//        Object();
//
//        У вас в проекте несколько классов. Можно ли в каждом из них объявить свой public static void main(String[] args)?
//
//        Ваш ответ
//        Нет
//
//        Если в коде какой-либо ветки if есть другое условие if, то такой условный оператор:
//
//        Ваш ответ
//        Комбинированный
//
//        Что появится в консоли в результате работы программы:
//
//        Ваш ответ
//        Java
//
//        Размер переменной типа char равен:
//
//        Ваш ответ
//        8 бит
//
//        С каким расширением хранится исходный код классов, а с каким скомпилированный?
//
//        Ваш ответ
//        Исходный код в .java, скомпилированный в .javac
//
//        По типу результата все методы можно разделить на:
//
//        Ваш ответ
//        Статические и не статические
//
//        Экземпляр класса String напрямую нельзя создать из:
//
//        Ваш ответ
//        Экземпляра класса StringBuffer
//
//        Можно ли использовать оператор return в void методе:
//
//        Ваш ответ
//        Нет
//
//        Какой из перечисленных методов объявлен некорректно:
//
//        Ваш ответ
//        String makeText(char... arr)
//Может ли быть значение статического поля у объектов одного класса разным:
//
//        Ваш ответ
//        Да
//
//        Можно ли переопределить (override) private методы:
//
//        Ваш ответ
//        Да
//
//        Может ли в одном классе объявлено больше одного метода с именем main:
//
//        Ваш ответ
//        Нет
//
//        Есть два класса A и B, которые не связаны между собой наследованием и лежат в одном пакете. Каким образом можно вызвать public не статический метод doSomething() класса A в public не статическом методе класса B:
//
//        Ваш ответ
//        Просто вызвав метод doSomething() без указания класса или объекта, поскольку оба класса лежат в одном пакете, все методы класса A видны внутри класса B
//
//        Что такое значение переменной?
//
//        Ваш ответ
//        Участок в памяти, где хранятся данные
//
//        Какой способ в общем случае сравнит два объекта по значению?
//
//        Ваш ответ
//        equals(obj1 == obj2);
//
//        В классе-наследнике определён статический метод такой же, как в родительском.
//
//        Ваш ответ
//        Метод в классе-наследнике переопределит (override) родительский метод
//
//        Какой из перечисленных методов объявлен некорректно:
//
//        Ваш ответ
//        void printArray(int arr[])
//
//        Если в коде какой-либо ветки if есть другое условие if, то такой условный оператор:
//
//        Ваш ответ
//        Комбинированный
//
//        Какой вариант объявления массива некорректен:
//
//        Ваш ответ
//        int[] a = new int[5];
//Какой из типов данных является ссылочным (объектным)?
//
//        Ваш ответ
//        int
//
//        Если метод имеет тип boolean, какой вариант оператора return приведет к ошибке:
//
//
//        Ваш ответ
//        return 12 > 60;
//
//        Операторы сравнения <, >, <=, >= применимы для:
//
//        Ваш ответ
//        Логических переменных
//
//        Экземпляр класса String напрямую нельзя создать из:
//
//        Ваш ответ
//        Строкового литерала
//
//        Чем инициализируется по умолчанию локальная переменная ссылочного типа данных:
//
//        Ваш ответ
//        Null
//
//        Остановит ли когда-нибудь свою работу цикл вида:
//
//        Ваш ответ
//        Нет
public class Test {
     public static void main(String[] args) {
        String str = "Java";
        System.out.println(str.charAt(2));


     }

}